InformationRegisters/ИА_ПраваЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ПраваЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ПраваГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ПраваЗначения/Forms/ПросмотрЗначенийПрав/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
    ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
    Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(
    "ВЫБРАТЬ
    |   Т.Ссылка КАК Право,
    |   Т.ЗначениеПоУмолчанию КАК Значение
    |ИЗ
    |   ПланВидовХарактеристик.ИА_ПраваПользователей КАК Т
    |ГДЕ
    |   НЕ Т.ЭтоГруппа");
    Для каждого Стр Из Таб Цикл
        Стр.Значение = ИА_ПраваС.ЗначениеПрава(Пользователь, Стр.Право)
    КонецЦикла; 
    
    ЗначенияПрав.Загрузить(Таб);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Параметры.Свойство("Пользователь", Пользователь);
    
    ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
    ОбновитьНаСервере();
КонецПроцедуры
